/** Информация о типе карточки, необходимая для изменения внешнего вида Web-клиента при открытии карточек этого типа (цвет фона, заголовок). */
export interface ICardTypeInfo {
    /** Идентификатор типа карточки. */
    id: string;
    /** Имя типа карточки. */
    name: string;
    /** CSS-класс, содержащий стили для изменения внешнего вида Web-клиента (например, цвет фона шапки и меню). */
    cssClass: string;
    /** Заголовок, который будет отображен в шапке Web-клиента. */
    caption: string;
}
