/**
 * Содержит данные операции редактирования, зарегистрированной в *Конструкторе состояний*.
 */
export interface IEditOperation {
    /** Идентификатор операции редактирования в *Конструкторе состояний*. */
    id: string;
    /** Идентификатор встроенной (в карточку) операции редактирования. */
    builtInId?: string;
    /** Отображаемое название операции редактирования. */
    caption: string;
    /** Флаг, указывающий, что операция доступна для текущего состояния карточки: true - доступна, false - не доступна. */
    available: boolean;
    /** Строковое наименование операции редактирования */
    alias: string;
}
